Documents/НаправлениеНаМедицинскийОсмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НаправлениеНаМедицинскийОсмотр</Name>
			<BasedOn>
				<xr:Item>Document.РешениеОПриемеНаРаботу</xr:Item>
				<xr:Item>Document.РешениеОКадровомПереводе</xr:Item>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаОМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаДМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторыИВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внеплановый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НаправлениеНаМедицинскийОсмотр/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НаправлениеНаМедицинскийОсмотр";
	КомандаПечати.Представление = НСтр("ru = 'Направление на медицинский осмотр'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Печать направления
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "НаправлениеНаМедицинскийОсмотр");
	Если ПечатнаяФорма <> Неопределено Тогда
		// имена файлов
		ИменаФайлов = Новый Соответствие;
		Шаблон = НСтр("ru = 'Направление на медосмотр [ФизическоеЛицо] - [Организация] (№[Номер] от [Дата])'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,ФизическоеЛицо,Номер,Дата,Ссылка");
		Для Каждого Ссылка Из МассивОбъектов Цикл
			РеквизитыДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			РеквизитыДокумента.ФизическоеЛицо = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(РеквизитыДокумента.ФизическоеЛицо));
			РеквизитыДокумента.Дата = Формат(РеквизитыДокумента.Дата, "ДЛФ=D");
			РеквизитыДокумента.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер);
			ИмяФайла = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);
			ИменаФайлов.Вставить(Ссылка, ИмяФайла);
		КонецЦикла;
		
		// описание печатной формы
		ПечатнаяФорма.ТабличныйДокумент = ПечатьНаправленияНаМедицинскийОсмотр(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Направление на медицинский осмотр'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.НаправлениеНаМедицинскийОсмотр.ПФ_MXL_НаправлениеНаМедицинскийОсмотр";
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = ИменаФайлов;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Направление'"));
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"МедицинскиеОсмотры");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

Функция ОписаниеПодписейДокумента() Экспорт 

	ОписаниеПодписей = ПодписиДокументов.ОписаниеТаблицыПодписей();
	
	ОписаниеПодписи = ПодписиДокументов.ОписаниеРеквизитовПодписанта();
	ОписаниеПодписи.ФизическоеЛицо = "СпециалистПоОхранеТруда";
	ОписаниеПодписи.Должность = "ДолжностьСпециалистаПоОхранеТруда";
	ОписаниеПодписи.ОснованиеПодписи = "ОснованиеПодписиСпециалистаПоОхранеТруда";
	
	ПереопределяемыеИмена = Новый Соответствие;
	ПереопределяемыеИмена.Вставить("ОтветственныйЗаОхрануТруда", ОписаниеПодписи);

	РолиОтветственных = "Руководитель, ОтветственныйЗаОхрануТруда";
	ПодписиДокументов.ДобавитьОписаниеПодписейОрганизации(ОписаниеПодписей, РолиОтветственных, ПереопределяемыеИмена);
	
	Возврат ОписаниеПодписей;

КонецФункции

Функция ДанныеНаправления(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Направление.Ссылка КАК Ссылка,
		|	Направление.Номер КАК Номер,
		|	Направление.Дата КАК Дата,
		|	Направление.Проведен КАК Проведен,
		|	Направление.Организация КАК Организация,
		|	Направление.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Направление.РабочееМесто КАК РабочееМесто,
		|	Направление.ДатаОсмотра КАК ДатаОсмотра,
		|	Направление.ВидОсмотра КАК ВидОсмотра,
		|	Направление.ТипОсмотра КАК ТипОсмотра,
		|	Направление.Ответственный КАК Ответственный,
		|	Направление.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК Направление
		|ГДЕ
		|	Направление.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеДляЗаполнения() Экспорт
	
	Описание = Новый Структура(
		"Организация,
		|ТипОсмотра,
		|ВидОсмотра,
		|МедицинскаяОрганизация,
		|ДатаОсмотра,
		|ФизическоеЛицо,
		|РабочееМесто");
	
	Возврат Описание;
	
КонецФункции

#Область ПечатьНаправления

// Процедура печати направления.
//
Функция ПечатьНаправленияНаМедицинскийОсмотр(Направления, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НаправлениеНаМедицинскийОсмотр";
	
	ИмяМакета = "НаправлениеНаМедицинскийОсмотр";
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Организация");
	ОбластиМакета.Вставить("Заголовок");
	ОбластиМакета.Вставить("НомерДата");
	ОбластиМакета.Вставить("МедицинскаяОрганизация");
	ОбластиМакета.Вставить("ФизическоеЛицо");
	ОбластиМакета.Вставить("ПоступающийРаботающий");
	ОбластиМакета.Вставить("МестоРаботы");
	ОбластиМакета.Вставить("ВредныеФакторы");
	ОбластиМакета.Вставить("Подпись");
	
	Макет302Н = УправлениеПечатью.МакетПечатнойФормы("Документ.НаправлениеНаМедицинскийОсмотр.ПФ_MXL_НаправлениеНаМедицинскийОсмотр");
	Макет29Н = УправлениеПечатью.МакетПечатнойФормы("Документ.НаправлениеНаМедицинскийОсмотр.ПФ_MXL_НаправлениеНаМедицинскийОсмотр29Н");
	
	ДанныеДляПечати = ДанныеПечатиНаправлений(Направления);
	
	// Вывод форм для субъектов.
	ПервыйДокумент = Истина;
	Для Каждого ОписаниеНаправления Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		// ЗУПК
		Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадрыКОРП") Тогда
		// ЗУПК
		Если ОписаниеНаправления.ЭтоНовыйМакет29Н Тогда
			Макет = Макет29Н;
		Иначе
			Макет = Макет302Н;
		КонецЕсли;
		// ЗУПК
		Иначе
			Макет = Макет29Н;
		КонецЕсли;
		// ЗУПК
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Формируем печатную форму направления.
		НаправлениеФорма = Новый ТабличныйДокумент;
		Для Каждого КлючИЗначение Из ОбластиМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(КлючИЗначение.Ключ);
			ОбластьМакета.Параметры.Заполнить(ОписаниеНаправления);
			НаправлениеФорма.Вывести(ОбластьМакета);
		КонецЦикла;
		ТабличныйДокумент.Вывести(НаправлениеФорма);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОписаниеНаправления.ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиНаправлений(Направления)
	
	ДатаПриказа29н = МедицинскиеОсмотры.ДатаПриказа29н();
	
	ДанныеПечати = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Направления", Направления);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Направление.Ссылка КАК ДокументСсылка,
		|	Направление.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА Направление.ДатаОсмотра = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Направление.Дата
		|		ИНАЧЕ Направление.ДатаОсмотра
		|	КОНЕЦ КАК Дата,
		|	Направление.Организация КАК Организация,
		|	Направление.Организация.ИНН КАК ОрганизацияИНН,
		|	Направление.Организация.ОГРН КАК ОрганизацияОГРН,
		|	Направление.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Направление.ФизическоеЛицо.ФИО КАК ФизическоеЛицоФИО,
		|	Направление.ДатаРождения КАК ДатаРождения,
		|	Направление.НомерПолисаОМС КАК НомерПолисаОМС,
		|	Направление.НомерПолисаДМС КАК НомерПолисаДМС,
		|	Направление.РабочееМесто КАК РабочееМесто,
		|	Направление.МедицинскаяОрганизация КАК МедицинскаяОрганизация,
		|	Направление.МедицинскаяОрганизация.Наименование КАК МедицинскаяОрганизацияНаименование,
		|	Направление.МедицинскаяОрганизация.ОГРН КАК МедицинскаяОрганизацияОГРН,
		// ЗУПК
		|	Направление.МедицинскаяОрганизация.БИН КАК МедицинскаяОрганизацияБИН,
		// ЗУПК
		|	Направление.МедицинскаяОрганизация.Адрес КАК МедицинскаяОрганизацияАдрес,
		|	Направление.Подразделение КАК Подразделение,
		|	Направление.Должность КАК Должность,
		|	Направление.ТипОсмотра КАК ТипОсмотра,
		|	Направление.ВидОсмотра КАК ВидОсмотра,
		|	Направление.ДолжностьСпециалистаПоОхранеТруда КАК ОтветственныйДолжность,
		|	Направление.СпециалистПоОхранеТруда.Фамилия КАК ОтветственныйФамилия,
		|	Направление.СпециалистПоОхранеТруда.Имя КАК ОтветственныйИмя,
		|	Направление.СпециалистПоОхранеТруда.Отчество КАК ОтветственныйОтчество,
		|	Направление.СпециалистПоОхранеТруда.Инициалы КАК ОтветственныйИнициалы,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторыИВидыРабот КАК ВредныеФакторыИВидыРабот
		|				ГДЕ
		|					ВредныеФакторыИВидыРабот.Ссылка = Направление.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВредныеФакторыИВидыРабот,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторы КАК ВредныеФакторы
		|				ГДЕ
		|					ВредныеФакторы.Ссылка = Направление.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВредныеФакторы,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					Документ.НаправлениеНаМедицинскийОсмотр.ВидыРабот КАК ВидыРабот
		|				ГДЕ
		|					ВидыРабот.Ссылка = Направление.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВидыРабот
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК Направление
		|ГДЕ
		|	Направление.Ссылка В(&Направления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыИВидыРабот.Ссылка КАК ДокументСсылка,
		|	ВредныеФакторыИВидыРабот.НомерСтроки КАК НомерСтроки,
		|	ВредныеФакторыИВидыРабот.ВредныйФактор КАК ВредныйФактор
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторыИВидыРабот КАК ВредныеФакторыИВидыРабот
		|ГДЕ
		|	ВредныеФакторыИВидыРабот.Ссылка В(&Направления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторы.Ссылка КАК ДокументСсылка,
		|	ВредныеФакторы.НомерСтроки КАК НомерСтроки,
		|	ВредныеФакторы.ВредныйФактор КАК ВредныйФактор
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторы КАК ВредныеФакторы
		|ГДЕ
		|	ВредныеФакторы.Ссылка В(&Направления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРабот.Ссылка КАК ДокументСсылка,
		|	ВидыРабот.НомерСтроки КАК НомерСтроки,
		|	ВидыРабот.ВидРабот КАК ВидРабот
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВидыРабот КАК ВидыРабот
		|ГДЕ
		|	ВидыРабот.Ссылка В(&Направления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаВредныхФакторовИВидовРабот = РезультатыЗапроса[1].Выбрать();
	ВыборкаВредныхФакторов = РезультатыЗапроса[2].Выбрать();
	ВыборкаВидовРабот = РезультатыЗапроса[3].Выбрать();
	
	ВыборкаНаправлений = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаНаправлений.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		Если ВыборкаНаправлений.Дата >= ДатаПриказа29н Тогда
			ЗаполнитьОписаниеНаправления(Описание, ВыборкаНаправлений, ВыборкаВредныхФакторовИВидовРабот);
		Иначе
			ЗаполнитьОписаниеНаправления(Описание, ВыборкаНаправлений, ВыборкаВредныхФакторов, ВыборкаВидовРабот);
		КонецЕсли;		
		ДанныеПечати.Добавить(Описание);
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура(
		"ДокументСсылка,
		|ЭтоНовыйМакет29Н,
		|ТипОсмотра,
		|ВидОсмотра,
		|Дата,
		|Номер,
		|ОрганизацияПредставление,
		|ФормаСобственностиПредставление,
		|ОКВЭДПредставление,
		|МедицинскаяОрганизацияПредставление,
		|ФизическоеЛицоФИО,
		|ДатаРожденияПредставление,
		|НомерПолиса,
		|ПоступающийРаботающий,
		|ПодразделениеПредставление,
		|ДолжностьПредставление,
		|ВредныеФакторыПредставление,
		|ВидыРаботПредставление,
		|ОтветственныйДолжностьПредставление,
		|ОтветственныйФИО");
	Описание.ВредныеФакторыПредставление = "";
	Описание.ВидыРаботПредставление = "";
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписаниеНаправления(Описание, ВыборкаНаправлений, ВыборкаВредныхФакторов, ВыборкаВидовРабот = Неопределено)
	
	ЗаполнитьЗначенияСвойств(Описание, ВыборкаНаправлений);
	
	Описание.ТипОсмотра = ПредставлениеТипаОсмотраПоВидуОсмотра(ВыборкаНаправлений.ТипОсмотра, ВыборкаНаправлений.ВидОсмотра);
	Описание.ВидОсмотра = НРег(ВыборкаНаправлений.ВидОсмотра);
	Описание.Дата = Формат(ВыборкаНаправлений.Дата, "ДЛФ=D");
	Описание.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаНаправлений.Номер);
	
	ЗаполнитьРеквизитыОрганизации(ВыборкаНаправлений.Организация, Описание);
	ЗаполнитьПредставлениеМедицинскойОрганизации(ВыборкаНаправлений, Описание.МедицинскаяОрганизацияПредставление);
	
	Описание.ФизическоеЛицоФИО = ВыборкаНаправлений.ФизическоеЛицоФИО;
	Описание.ДатаРожденияПредставление = Формат(ВыборкаНаправлений.ДатаРождения, "ДЛФ=D");
	
	Полисы = Новый Массив;
	Если ЗначениеЗаполнено(ВыборкаНаправлений.НомерПолисаОМС) Тогда
		Полисы.Добавить(СтрШаблон(НСтр("ru = 'ОМС: %1'"), ВыборкаНаправлений.НомерПолисаОМС));
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаНаправлений.НомерПолисаДМС) Тогда
		Полисы.Добавить(СтрШаблон(НСтр("ru = 'ДМС: %1'"), ВыборкаНаправлений.НомерПолисаДМС));
	КонецЕсли;
	Разделитель = ";" + Символы.НПП;
	Описание.НомерПолиса = СтрСоединить(Полисы, Разделитель);
	
	Описание.ПоступающийРаботающий = НСтр("ru = 'Работающий'");
	Если ВыборкаНаправлений.ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Предварительный Тогда
		Описание.ПоступающийРаботающий = НСтр("ru = 'Поступающий на работу'");
	КонецЕсли;
	
	Описание.ПодразделениеПредставление = Строка(ВыборкаНаправлений.Подразделение);
	Описание.ДолжностьПредставление = Строка(ВыборкаНаправлений.Должность);
	
	Описание.ОтветственныйДолжностьПредставление = Строка(ВыборкаНаправлений.ОтветственныйДолжность);
	Если ЗначениеЗаполнено(ВыборкаНаправлений.ОтветственныйФамилия) Тогда
		СтруктураФИО = Новый Структура;
		СтруктураФИО.Вставить("Фамилия", ВыборкаНаправлений.ОтветственныйФамилия);
		СтруктураФИО.Вставить("Имя", ВыборкаНаправлений.ОтветственныйИмя);
		СтруктураФИО.Вставить("Отчество", ВыборкаНаправлений.ОтветственныйОтчество);
		СтруктураФИО.Вставить("Инициалы", ВыборкаНаправлений.ОтветственныйИнициалы);
		Описание.ОтветственныйФИО = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(СтруктураФИО);
	КонецЕсли;
	
	Если ВыборкаВидовРабот = Неопределено Тогда
		Описание.ЭтоНовыйМакет29Н = Истина;
		Если ВыборкаНаправлений.ЕстьВредныеФакторыИВидыРабот Тогда
			Пока ВыборкаВредныхФакторов.НайтиСледующий(ВыборкаНаправлений.ДокументСсылка, "ДокументСсылка") Цикл
				Описание.ВредныеФакторыПредставление = Описание.ВредныеФакторыПредставление + Строка(ВыборкаВредныхФакторов.ВредныйФактор) + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Описание.ЭтоНовыйМакет29Н = Ложь;
		Если ВыборкаНаправлений.ЕстьВредныеФакторы Тогда
			Пока ВыборкаВредныхФакторов.НайтиСледующий(ВыборкаНаправлений.ДокументСсылка, "ДокументСсылка") Цикл
				Описание.ВредныеФакторыПредставление = Описание.ВредныеФакторыПредставление + Строка(ВыборкаВредныхФакторов.ВредныйФактор) + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		
		Если ВыборкаНаправлений.ЕстьВидыРабот Тогда
			Пока ВыборкаВидовРабот.НайтиСледующий(ВыборкаНаправлений.ДокументСсылка, "ДокументСсылка") Цикл
				Описание.ВидыРаботПредставление = Описание.ВидыРаботПредставление + Строка(ВыборкаВидовРабот.ВидРабот) + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПредставлениеТипаОсмотраПоВидуОсмотра(ТипОсмотра, ВидОсмотра)
	
	Если ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр Тогда
		Возврат НРег(ТипОсмотра);
	КонецЕсли;
	
	Если ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Внеплановый Тогда
		Возврат НСтр("ru = 'внеплановое'");
	ИначеЕсли ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Периодический Тогда
		Возврат НСтр("ru = 'периодическое'");
	ИначеЕсли ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Предварительный Тогда
		Возврат НСтр("ru = 'предварительное'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ЗаполнитьРеквизитыОрганизации(Организация, Описание)
	
	ИменаПолей =
	"НаимЮЛПол,
	|ИННЮЛ,
	|ОГРН,
	|ПолныйАдрЮР,
	|ТелОрганизации,
	|ФаксОрганизации,
	|АдресЭлектроннойПочтыОрганизации,
	|ОКФС,
	|НаименованиеОКФС,
	|ОКВЭД,
	|ОКВЭД2,
	|ОснВидДеят,
	|ОснВидДеят2";
	
	УстановитьПривилегированныйРежим(Истина);
	СведенияОрганизации = ЗарплатаКадры.СведенияОбОрганизации(Организация, ИменаПолей);
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьПредставлениеОрганизации(СведенияОрганизации, Описание.ОрганизацияПредставление);
	ЗаполнитьОКВЭДОрганизации(СведенияОрганизации, Описание.ОКВЭДПредставление);
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеОрганизации(СведенияОрганизации, Представление)
	
	Представление = "";
	
	Если ЗначениеЗаполнено(СведенияОрганизации.ИННЮЛ) Тогда
		// ЗУПК
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'БИН/ИИН %1,'"), СведенияОрганизации.ИННЮЛ);
		// ЗУПК
	КонецЕсли;
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадрыКОРП") Тогда
	// ЗУПК
	Если ЗначениеЗаполнено(СведенияОрганизации.ОГРН) Тогда
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = Представление + Символы.НПП;
		КонецЕсли;
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ОГРН %1,'"), СведенияОрганизации.ОГРН);
	КонецЕсли;
	// ЗУПК
	КонецЕсли;
	// ЗУПК
	
	Если ЗначениеЗаполнено(СтрЗаменить(СведенияОрганизации.ПолныйАдрЮР, ",", "")) Тогда
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = Представление + Символы.ПС;
		КонецЕсли;
		Представление = Представление + СведенияОрганизации.ПолныйАдрЮР + ",";
		Если ЗначениеЗаполнено(СведенияОрганизации.ТелОрганизации) Тогда
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + " ";
			КонецЕсли;
			СведенияОрганизации.ТелОрганизации = СтрЗаменить(СведенияОрганизации.ТелОрганизации, " ", Символы.НПП);
			Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'тел.%2%1,'"), СведенияОрганизации.ТелОрганизации, Символы.НПП);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОрганизации.ФаксОрганизации) Тогда
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + " ";
			КонецЕсли;
			СведенияОрганизации.ФаксОрганизации = СтрЗаменить(СведенияОрганизации.ФаксОрганизации, " ", Символы.НПП);
			Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'факс%2%1,'"), СведенияОрганизации.ФаксОрганизации, Символы.НПП);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОрганизации.АдресЭлектроннойПочтыОрганизации) Тогда
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + " ";
			КонецЕсли;
			Представление = Представление + СведенияОрганизации.АдресЭлектроннойПочтыОрганизации + ",";
		КонецЕсли;
		Если Прав(Представление, 1) = "," Тогда
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Представление);
		КонецЕсли;
	КонецЕсли;
	
	Представление = СведенияОрганизации.НаимЮЛПол + Символы.ПС + Представление;
	
КонецПроцедуры

Процедура ЗаполнитьОКВЭДОрганизации(СведенияОрганизации, Представление)
	
	Представление = "";
	
	Если ЗначениеЗаполнено(СведенияОрганизации.ОКФС) Тогда
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Форма собственности %1'"), 
			СведенияОрганизации.ОКФС);
		Если ЗначениеЗаполнено(СведенияОрганизации.НаименованиеОКФС) Тогда
			Представление = Представление + ", " + СведенияОрганизации.НаименованиеОКФС;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОрганизации.ОКВЭД) Тогда
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = Представление + Символы.ПС;
		КонецЕсли;
		// ЗУПК
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"), СведенияОрганизации.ОКВЭД);
		// ЗУПК
		Если ЗначениеЗаполнено(СведенияОрганизации.ОснВидДеят) Тогда
			Представление = Представление + ", " + СведенияОрганизации.ОснВидДеят;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОрганизации.ОКВЭД2) Тогда
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = Представление + Символы.ПС;
		КонецЕсли;
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ОКВЭД %1'"), СведенияОрганизации.ОКВЭД2);
		Если ЗначениеЗаполнено(СведенияОрганизации.ОснВидДеят2) Тогда
			Представление = Представление + ", " + СведенияОрганизации.ОснВидДеят2;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеМедицинскойОрганизации(Выборка, Представление)
	
	Представление = Выборка.МедицинскаяОрганизацияНаименование;
	
	Если ЗначениеЗаполнено(Выборка.МедицинскаяОрганизацияАдрес) Тогда
		Представление = Представление + ", " + Выборка.МедицинскаяОрганизацияАдрес;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МедицинскаяОрганизацияАдрес) Тогда
		Представление = Представление + ", " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			// ЗУПК
			НСтр("ru = 'БИН%2%1'"),
			Выборка.МедицинскаяОрганизацияБИН,
			// ЗУПК
			Символы.НПП);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
